# Homework 1

### Loading data...

In [175]:
import pandas as pd

pd.__version__

'1.5.2'

In [176]:
df = pd.read_csv('green_tripdata_2019-01.csv', nrows=100)

In [177]:
df.lpep_pickup_datetime  = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

In [178]:
from sqlalchemy import create_engine

In [179]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [180]:
print(pd.io.sql.get_schema(df, name='green_tripdata', con=engine))

CREATE TABLE green_tripdata (
	"VendorID" BIGINT,
	lpep_pickup_datetime TIMESTAMP WITHOUT TIME ZONE,
	lpep_dropoff_datetime TIMESTAMP WITHOUT TIME ZONE,
	store_and_fwd_flag TEXT,
	"RatecodeID" BIGINT,
	"PULocationID" BIGINT,
	"DOLocationID" BIGINT,
	passenger_count BIGINT,
	trip_distance FLOAT(53),
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	ehail_fee FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	payment_type BIGINT,
	trip_type BIGINT,
	congestion_surcharge FLOAT(53)
)

In [181]:
df_iter = pd.read_csv('green_tripdata_2019-01.csv', iterator=True, chunksize=100000)

In [182]:
df = next(df_iter)
len(df)

100000

In [183]:
df.lpep_pickup_datetime  = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)
df

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2,2018-12-21 15:17:29,2018-12-21 15:18:57,N,1,264,264,5,0.00,3.00,0.5,0.5,0.00,0.00,NaN,0.3,4.30,2,1,NaN
1,2,2019-01-01 00:10:16,2019-01-01 00:16:32,N,1,97,49,2,0.86,6.00,0.5,0.5,0.00,0.00,NaN,0.3,7.30,2,1,NaN
2,2,2019-01-01 00:27:11,2019-01-01 00:31:38,N,1,49,189,2,0.66,4.50,0.5,0.5,0.00,0.00,NaN,0.3,5.80,1,1,NaN
3,2,2019-01-01 00:46:20,2019-01-01 01:04:54,N,1,189,17,2,2.68,13.50,0.5,0.5,2.96,0.00,NaN,0.3,19.71,1,1,NaN
4,2,2019-01-01 00:19:06,2019-01-01 00:39:43,N,1,82,258,1,4.53,18.00,0.5,0.5,0.00,0.00,NaN,0.3,19.30,2,1,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
99995,2,2019-01-06 09:56:09,2019-01-06 10:01:30,N,1,130,216,1,1.23,6.00,0.0,0.5,0.00,0.00,NaN,0.3,6.80,2,1,NaN
99996,2,2019-01-06 09:12:49,2019-01-06 09:52:38,N,5,218,16,1,21.44,47.65,0.0,0.5,0.00,5.76,NaN,0.0,53.91,1,2,NaN
99997,2,2019-01-06 09:02:06,2019-01-06 09:37:42,N,5,139,188,1,14.77,37.84,0.0,0.5,0.00,0.00,NaN,0.0,38.34,1,2,NaN
99998,2,2019-01-06 09:55:01,2019-01-06 10:04:34,N,1,72,188,1,1.80,8.50,0.0,0.5,0.00,0.00,NaN,0.3,9.30,1,1,NaN
99999,2,2019-01-06 09:59:04,2019-01-06 10:24:33,N,5,89,225,1,7.03,23.14,0.0,0.5,0.00,0.00,NaN,0.0,23.64,1,2,NaN

In [184]:
df.head(n=0).to_sql(name='green_tripdata', con=engine, if_exists='replace')

0

In [185]:
%time df.to_sql(name='green_tripdata', con=engine, if_exists='append')

CPU times: user 3.81 s, sys: 86.7 ms, total: 3.9 s
Wall time: 7.61 s

1000

In [186]:
from time import time

In [187]:
while True: 
    try:
        t_start = time()
    
        df = next(df_iter)

        df.lpep_pickup_datetime  = pd.to_datetime(df.lpep_pickup_datetime)
        df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)
    
        df.to_sql(name='green_tripdata', con=engine, if_exists='append')

        t_end = time()
     
        print('inserted another chunk, took %.3f second' % (t_end - t_start))
        
    except StopIteration:
        print("Finished ingesting data into the postgres database")  
        break

inserted another chunk, took 7.745 second
inserted another chunk, took 7.341 second
inserted another chunk, took 7.384 second
inserted another chunk, took 7.315 second
inserted another chunk, took 7.693 second
inserted another chunk, took 2.561 second
Finished ingesting data into the postgres database

In [188]:
!wget https://s3.amazonaws.com/nyc-tlc/misc/taxi+_zone_lookup.csv

--2023-01-21 19:24:53--  https://s3.amazonaws.com/nyc-tlc/misc/taxi+_zone_lookup.csv
Resolving s3.amazonaws.com (s3.amazonaws.com)... 54.231.225.56, 54.231.137.64, 54.231.172.48, ...
Connecting to s3.amazonaws.com (s3.amazonaws.com)|54.231.225.56|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 12322 (12K) [application/octet-stream]
Saving to: ‘taxi+_zone_lookup.csv.1’

taxi+_zone_lookup.c 100%[===================>]  12.03K  --.-KB/s    in 0.006s

2023-01-21 19:24:54 (1.82 MB/s) - ‘taxi+_zone_lookup.csv.1’ saved [12322/12322]

In [189]:
df_zones = pd.read_csv('taxi+_zone_lookup.csv')
df_zones

     LocationID        Borough                     Zone service_zone
0             1            EWR           Newark Airport          EWR
1             2         Queens              Jamaica Bay    Boro Zone
2             3          Bronx  Allerton/Pelham Gardens    Boro Zone
3             4      Manhattan            Alphabet City  Yellow Zone
4             5  Staten Island            Arden Heights    Boro Zone
..          ...            ...                      ...          ...
260         261      Manhattan       World Trade Center  Yellow Zone
261         262      Manhattan           Yorkville East  Yellow Zone
262         263      Manhattan           Yorkville West  Yellow Zone
263         264        Unknown                       NV          NaN
264         265        Unknown                      NaN          NaN

[265 rows x 4 columns]

In [190]:
df_zones.to_sql(name='zones', con=engine, if_exists='replace')

265

### Question 1. Knowing docker tags

Run the command to get information on Docker 

```docker --help```

Now run the command to get help on the "docker build" command

Which tag has the following text? - *Write the image ID to the file* 

- `--imageid string`
- `--iidfile string` ***
- `--idimage string`
- `--idfile string`

### Question 2. Understanding docker first run 

Run docker with the python:3.9 image in an interactive mode and the entrypoint of bash.
Now check the python modules that are installed ( use pip list). 
How many python packages/modules are installed?

pip list

- `Package    Version`
---------------------- 
- `pip        22.0.4` 
- `setuptools 58.1.0` 
- `wheel      0.38.4` 

- **three (3)**

## Question 3. Count records 

How many taxi trips were totally made on January 15?

Tip: started and finished on 2019-01-15. 

Remember that `lpep_pickup_datetime` and `lpep_dropoff_datetime` columns are in the format timestamp (date and hour+min+sec) and not in date.

- 20689
- 20530 **
- 17630
- 21090

In [191]:
sql = """
      SELECT COUNT(1)
      FROM green_tripdata
      WHERE
          lpep_pickup_datetime  BETWEEN '2019-01-15 00:00:00.000' AND '2019-01-15 23:59:59' AND
          lpep_dropoff_datetime BETWEEN '2019-01-15 00:00:00.000' AND '2019-01-15 23:59:59'
      """  
      
pd.read_sql(sql, con=engine)

   count
0  20530

## Question 4. Largest trip for each day

Which was the day with the largest trip distance?
Use the pick up time for your calculations.

- 2019-01-18
- 2019-01-28
- 2019-01-15 **
- 2019-01-10

In [192]:
sql = """
SELECT 
    CAST(DATE_PART('day', lpep_pickup_datetime) AS INT) day_in_january -- the only month loaded in
FROM 
    green_tripdata
WHERE trip_distance = (
    SELECT max(trip_distance)
    FROM green_tripdata
)
"""

pd.read_sql(sql, con=engine)

   day_in_january
0              15

## Question 5. The number of passengers

In 2019-01-01 how many trips had 2 and 3 passengers?
 
- 2: 1282 ; 3: 266
- 2: 1532 ; 3: 126
- 2: 1282 ; 3: 254 **
- 2: 1282 ; 3: 274

In [193]:
sql = """
SELECT 
    passenger_count, COUNT(1) 
FROM
    green_tripdata
WHERE 
    lpep_pickup_datetime BETWEEN '2019-01-01 00:00:00' AND '2019-01-01 23:59:59' AND
    passenger_count IN(2,3)
GROUP BY 
    passenger_count
ORDER BY 1
"""

pd.read_sql(sql, con=engine)

   passenger_count  count
0                2   1282
1                3    254

## Question 6. Largest tip

For the passengers picked up in the Astoria Zone which was the drop off zone that had the largest tip?
We want the name of the zone, not the id.

Note: it's not a typo, it's `tip` , not `trip`

- Central Park
- Jamaica
- South Ozone Park
- Long Island City/Queens Plaza **

In [195]:
sql = """
SELECT
    max(gtd.tip_amount) top_tip,
    dropoff."Zone" as zone
FROM 
    green_tripdata gtd
	    INNER JOIN
            zones as pickup
			ON(gtd."PULocationID" = pickup."LocationID")
        INNER JOIN
		    zones as dropoff
		    ON(gtd."DOLocationID" = dropoff."LocationID")
WHERE 
	pickup."Zone" = 'Astoria'
GROUP BY 
	dropoff."Zone"
ORDER BY 1 DESC
LIMIT 1;
"""

pd.read_sql(sql, con=engine)

   top_tip                           zone
0     88.0  Long Island City/Queens Plaza